index.org
#+title: NPV and IRR
#+author: Matt Brigida, Ph.D.
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Businesses Make Binary Decisions

#+begin_export html
<center><b>Invest or Do Not Invest</b></center>
<br>
<center><iframe src="./binary.jpg"></iframe></center>
<br>
<center><b>So we need binary decision rules.</b></center>
<br>
<br>
This presentation will provide an introduction to the two most important, Net Present Value (NPV) and Internal Rate of Return (IRR).
#+end_export

* Maximize Shareholder Wealth

Early in your study of corporate finance you should have learned the **Goal of Financial Management** above.  Clearly any decision rules we define must be consistent with this goal.

- NPV will be the change in the value of the firm's equity if the project is accepted.
- IRR will also generate accept decisions only if doing so increases the firm's equity.

Thus accepting all projects which have NPV > 0 will maximize shareholder wealth.

* Net Present Value (NPV)

*Net Present Value* is the sum of the investment's expected cash inflows and outflows discounted back to their present value at a risk adjusted rate. 

The NPV is defined by: 

$NPV = -C_0 + \frac{C_1}{(1+r)^1} + \frac{C_2}{(1+r)^2} + ... + \frac{C_n}{(1+r)^n}$ 

where: 

- $r$, is the discount rate per period
- $n$, the number of periods in the project's life
- $C$, the expected **incremental** cash flows per period
- $C_0$, the initial investment



* NPV Desicion Rule
<br>
<br>
<br>
<br>
<center>$NPV \geq \$0 \Rightarrow \text{Accept}$
<br>
<br>
<br>
$NPV < \$0 \Rightarrow \text{Reject}$</center>

* The Discount Rate

The discount rate is the rate required on other projects of similar risk.  You can think of it as an *opportunity cost*, because if the firm didn't use the funds for the project, then it could be paid as a dividend to shareholders.  Shareholders then can invest the money in a financial asset earning that assets required return.

-  Often the project is as risky as a company's existing operations, in which case you use the company's weighted average cost of capital (WACC).

-  It is incorrect to use the firm's cost of borrowing, for a couple reasons.  First the investment decision should be independent of the capital structure decision.  Also, by increasing borrowing, you increase your cost of equity capital [Modigliani and Miller, Proposition II](https://micfm.shinyapps.io/MM_propositions_mobile/). So debt only *appears* cheap.



* 

```{r, echo=FALSE, message=FALSE, warning=FALSE}
#{{{
sidebarLayout(
    sidebarPanel(
        inputPanel(
            sliderInput("cf.npv", label = "Cash Flow Per Period", min = 1, max = 500, step = 10, value = 50),
            sliderInput("periods.npv", label = "Number of Periods", min = 1, max = 50, step = 1, value = 20),
            sliderInput("initial.inv.npv", label = "Time 0 Investment", min = 1, max = 500, step = 1, value = 300),
            sliderInput("rate", label = "Discount Rate per Period", min = 0, max = .3, step = .01, value = .05)
        )
    ),
    mainPanel(
        renderPlot({
            cfs.npv <- c(-1 * (input$initial.inv.npv), rep(input$cf.npv, input$periods.npv))
            npv.sol <- sum(cfs.npv / (1 + input$rate)^{1:length(cfs.npv)})
            plot(0, ylim = c(0,1), xlim = c(0,1), type = "n", xaxt = "n", yaxt = "n", ylab = "", xlab = "")
            text(x = 0.5, y = 0.5, labels = paste0("NPV = $", round(npv.sol * 100, 2)), cex = 4)
        })
    )
)
#}}}
```


 

* Internal Rate of Return (IRR)

*Internal Rate of Return* is the discount rate ($r_{IRR}$) that makes the Net Present Value equal zero.  That is, we solve the following equation for the $IRR$, using an algorithm such as the [Newton-Raphson method](https://en.wikipedia.org/wiki/Newton%27s_method).
<br>
<br>
$-C_0 + \frac{C_1}{(1+r_{IRR})^1} + \frac{C_2}{(1+r_{IRR})^2} + ... + \frac{C_n}{(1+r_{IRR})^n} = 0$ 

Note while NPV will have a unique solution, IRR may have multiple solutions depending on the signs of the cash flows.  The interested reader can understand why by consulting the [Fundamental Theorem of Algebra](https://en.wikipedia.org/wiki/Fundamental_theorem_of_algebra), [Descartes' Rule of Signs](https://en.wikipedia.org/wiki/Descartes%27_rule_of_signs), and [Sturm's Theorem](https://en.wikipedia.org/wiki/Sturm%27s_theorem).

 

* IRR Desicion Rule
<br>
<br>
<br>
<br>
<center>$IRR > \text{Discount Rate} \Rightarrow \text{Accept}$
<br>
<br>
<br>
$IRR < \text{Discount Rate} \Rightarrow \text{Reject}$</center>

 


* 

```{r, echo=FALSE, message=FALSE, warning=FALSE}
#{{{
inputPanel(
    sliderInput("cf.irr", label = "Cash Flow Per Period", min = 1, max = 500, step = 10, value = 50),
    sliderInput("periods.irr", label = "Number of Periods", min = 1, max = 50, step = 1, value = 20),
    sliderInput("initial.inv.irr", label = "Time 0 Investment", min = 1, max = 500, step = 1, value = 300)
)

renderPlot({
    source(file = 'https://raw.githubusercontent.com/FinancialMarkets/corpfin/master/irr.R')
    cfs <- c(-1 * (input$initial.inv.irr), rep(input$cf.irr, input$periods.irr))
    irr.sol <- irr(cfs)$IRR
    plot(0, ylim = c(0,1), xlim = c(0,1), type = "n", xaxt = "n", yaxt = "n", ylab = "", xlab = "")
    text(x = 0.5, y = 0.5, labels = paste("IRR = ", round(irr.sol * 100, 2), "%"), cex = 5)
})
#}}}
```


<!-- use code from here to make a version of app which will read data from file:  http://stackoverflow.com/questions/29253481/data-specific-selectinput-choices-in-rmd-shiny/29255723#29255723 -->

 

