index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-19 Tue 21:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NPV and IRR</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">NPV and IRR</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge7dbcce">1. Businesses Make Binary Decisions</a></li>
<li><a href="#orgd9432d3">2. Maximize Shareholder Wealth</a></li>
<li><a href="#orgff7d727">3. Net Present Value (NPV)</a></li>
<li><a href="#org58938e5">4. NPV Desicion Rule</a></li>
<li><a href="#org6e4e48f">5. The Discount Rate</a></li>
<li><a href="#org070d412">6. </a></li>
<li><a href="#org4f9d5cf">7. Internal Rate of Return (IRR)</a></li>
<li><a href="#orgbddc170">8. IRR Desicion Rule</a></li>
<li><a href="#org57a09d3">9. </a></li>
<li><a href="#org01adb30">10. Choosing Between Projects</a></li>
<li><a href="#org9548767">11. </a></li>
<li><a href="#org9aa1afa">12. Calculator</a></li>
<li><a href="#org950277f">13. Self-Quiz Questions</a></li>
<li><a href="#orga0fb22d">14. Reading Ease Score</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge7dbcce" class="outline-2">
<h2 id="orge7dbcce"><span class="section-number-2">1.</span> Businesses Make Binary Decisions</h2>
<div class="outline-text-2" id="text-1">
<center><b>Invest or Do Not Invest</b></center>
<br>
<center><iframe src="./binary.jpg"></iframe></center>
<br>
<center><b>So we need binary decision rules.</b></center>
<br>
<br>
This presentation will provide an introduction to the two most important, Net Present Value (NPV) and Internal Rate of Return (IRR).
</div>
</div>

<div id="outline-container-orgd9432d3" class="outline-2">
<h2 id="orgd9432d3"><span class="section-number-2">2.</span> Maximize Shareholder Wealth</h2>
<div class="outline-text-2" id="text-2">
<p>
Early in your study of corporate finance you should have learned the <b><b>Goal of Financial Management</b></b> above.  Clearly any decision rules we define must be consistent with this goal.
</p>

<ul class="org-ul">
<li>NPV will be the change in the value of the firm's equity if the project is accepted.</li>
<li>IRR will also generate accept decisions only if doing so increases the firm's equity.</li>
</ul>

<p>
Thus accepting all projects which have NPV &gt; 0 will maximize shareholder wealth.
</p>
</div>
</div>

<div id="outline-container-orgff7d727" class="outline-2">
<h2 id="orgff7d727"><span class="section-number-2">3.</span> Net Present Value (NPV)</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Net Present Value</b> is the sum of the investment's expected cash inflows and outflows discounted back to their present value at a risk adjusted rate. 
</p>

<p>
The NPV is defined by: 
</p>

<p>
\(NPV = -C_0 + \frac{C_1}{(1+r)^1} + \frac{C_2}{(1+r)^2} + ... + \frac{C_n}{(1+r)^n}\) 
</p>

<p>
where: 
</p>

<ul class="org-ul">
<li>\(r\), is the discount rate per period</li>
<li>\(n\), the number of periods in the project's life</li>
<li>\(C\), the expected <b><b>incremental</b></b> cash flows per period</li>
<li>\(C_0\), the initial investment</li>
</ul>
</div>
</div>



<div id="outline-container-org58938e5" class="outline-2">
<h2 id="org58938e5"><span class="section-number-2">4.</span> NPV Desicion Rule</h2>
<div class="outline-text-2" id="text-4">
<p>
&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
&lt;center&gt;$NPV &ge; \\(0 \Rightarrow \text{Accept}\)
&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
$NPV &lt; \\(0 \Rightarrow \text{Reject}\)&lt;/center&gt;
</p>
</div>
</div>

<div id="outline-container-org6e4e48f" class="outline-2">
<h2 id="org6e4e48f"><span class="section-number-2">5.</span> The Discount Rate</h2>
<div class="outline-text-2" id="text-5">
<p>
The discount rate is the rate required on other projects of similar risk.  You can think of it as an <b>opportunity cost</b>, because if the firm didn't use the funds for the project, then it could be paid as a dividend to shareholders.  Shareholders then can invest the money in a financial asset earning that assets required return.
</p>

<ul class="org-ul">
<li>Often the project is as risky as a company's existing operations, in which case you use the company's weighted average cost of capital (WACC).</li>

<li>It is incorrect to use the firm's cost of borrowing, for a couple reasons.  First the investment decision should be independent of the capital structure decision.  Also, by increasing borrowing, you increase your cost of equity capital [Modigliani and Miller, Proposition II](<a href="https://micfm.shinyapps.io/MM_propositions_mobile/">https://micfm.shinyapps.io/MM_propositions_mobile/</a>). So debt only <b>appears</b> cheap.</li>
</ul>
</div>
</div>



<div id="outline-container-org070d412" class="outline-2">
<h2 id="org070d412"><span class="section-number-2">6.</span> </h2>
<div class="outline-text-2" id="text-6">
<p>
```{r, echo=FALSE, message=FALSE, warning=FALSE}
#{{{
sidebarLayout(
    sidebarPanel(
        inputPanel(
            sliderInput("cf.npv", label = "Cash Flow Per Period", min = 1, max = 500, step = 10, value = 50),
            sliderInput("periods.npv", label = "Number of Periods", min = 1, max = 50, step = 1, value = 20),
            sliderInput("initial.inv.npv", label = "Time 0 Investment", min = 1, max = 500, step = 1, value = 300),
            sliderInput("rate", label = "Discount Rate per Period", min = 0, max = .3, step = .01, value = .05)
        )
    ),
    mainPanel(
        renderPlot({
            cfs.npv &lt;- c(-1 * (input$initial.inv.npv), rep(input$cf.npv, input$periods.npv))
            npv.sol &lt;- sum(cfs.npv / (1 + input$rate)<sup>1:length(cfs.npv)</sup>)
            plot(0, ylim = c(0,1), xlim = c(0,1), type = "n", xaxt = "n", yaxt = "n", ylab = "", xlab = "")
            text(x = 0.5, y = 0.5, labels = paste0("NPV = $", round(npv.sol * 100, 2)), cex = 4)
        })
    )
)
#}}}
```
</p>
</div>
</div>




<div id="outline-container-org4f9d5cf" class="outline-2">
<h2 id="org4f9d5cf"><span class="section-number-2">7.</span> Internal Rate of Return (IRR)</h2>
<div class="outline-text-2" id="text-7">
<p>
<b>Internal Rate of Return</b> is the discount rate (\(r_{IRR}\)) that makes the Net Present Value equal zero.  That is, we solve the following equation for the \(IRR\), using an algorithm such as the [Newton-Raphson method](<a href="https://en.wikipedia.org/wiki/Newton%27s_method">https://en.wikipedia.org/wiki/Newton%27s_method</a>).
&lt;br&gt;
&lt;br&gt;
\(-C_0 + \frac{C_1}{(1+r_{IRR})^1} + \frac{C_2}{(1+r_{IRR})^2} + ... + \frac{C_n}{(1+r_{IRR})^n} = 0\) 
</p>

<p>
Note while NPV will have a unique solution, IRR may have multiple solutions depending on the signs of the cash flows.  The interested reader can understand why by consulting the [Fundamental Theorem of Algebra](<a href="https://en.wikipedia.org/wiki/Fundamental_theorem_of_algebra">https://en.wikipedia.org/wiki/Fundamental_theorem_of_algebra</a>), [Descartes' Rule of Signs](<a href="https://en.wikipedia.org/wiki/Descartes%27_rule_of_signs">https://en.wikipedia.org/wiki/Descartes%27_rule_of_signs</a>), and [Sturm's Theorem](<a href="https://en.wikipedia.org/wiki/Sturm%27s_theorem">https://en.wikipedia.org/wiki/Sturm%27s_theorem</a>).
</p>
</div>
</div>



<div id="outline-container-orgbddc170" class="outline-2">
<h2 id="orgbddc170"><span class="section-number-2">8.</span> IRR Desicion Rule</h2>
<div class="outline-text-2" id="text-8">
<p>
&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
&lt;center&gt;\(IRR > \text{Discount Rate} \Rightarrow \text{Accept}\)
&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
\(IRR < \text{Discount Rate} \Rightarrow \text{Reject}\)&lt;/center&gt;
</p>
</div>
</div>




<div id="outline-container-org57a09d3" class="outline-2">
<h2 id="org57a09d3"><span class="section-number-2">9.</span> </h2>
<div class="outline-text-2" id="text-9">
<p>
```{r, echo=FALSE, message=FALSE, warning=FALSE}
#{{{
inputPanel(
    sliderInput("cf.irr", label = "Cash Flow Per Period", min = 1, max = 500, step = 10, value = 50),
    sliderInput("periods.irr", label = "Number of Periods", min = 1, max = 50, step = 1, value = 20),
    sliderInput("initial.inv.irr", label = "Time 0 Investment", min = 1, max = 500, step = 1, value = 300)
)
</p>

<p>
renderPlot({
    source(file = 'https://raw.githubusercontent.com/FinancialMarkets/corpfin/master/irr.R')
    cfs &lt;- c(-1 * (input$initial.inv.irr), rep(input$cf.irr, input$periods.irr))
    irr.sol &lt;- irr(cfs)$IRR
    plot(0, ylim = c(0,1), xlim = c(0,1), type = "n", xaxt = "n", yaxt = "n", ylab = "", xlab = "")
    text(x = 0.5, y = 0.5, labels = paste("IRR = ", round(irr.sol * 100, 2), "%"), cex = 5)
})
#}}}
```
</p>


<p>
&lt;!&#x2013; use code from here to make a version of app which will read data from file:  <a href="http://stackoverflow.com/questions/29253481/data-specific-selectinput-choices-in-rmd-shiny/29255723#29255723">http://stackoverflow.com/questions/29253481/data-specific-selectinput-choices-in-rmd-shiny/29255723#29255723</a> &#x2013;&gt;
</p>
</div>
</div>
