index.org
* Choosing Between Projects

When the accept/reject decision on one project does not affect another project, these projects are known as **independent**.  If accepting one project means you must reject another, then these projects are **mutually exclusive**. 

If a project has negative cash flows followed by all positive cash flows, then the project's cash flows are known as **conventional**.

-  If two projects are independent and have conventional cash flows, then NPV and IRR will lead to the same accept/reject decision, i.e. $NPV \iff IRR$.  This is shown on the app in the following slide.

-  However, if you must rank projects -- and projects are either mutually exclusive or cash flows are not conventional -- then use NPV.  NPV will generate the correct decision, though IRR may not.

 

* 

<!-- interactive app showing NVP for all discount rates and therefore IRR when crossing the x-axis -->

```{r, echo = FALSE, message = FALSE}
library(highcharter)

inputPanel(
    sliderInput("cfs1", label = "Cash Flow Per Period", min = 1, max = 45, step = 1, value = 30),
    sliderInput("periods1", label = "Number of Periods", min = 1, max = 50, step = 1, value = 20),
    sliderInput("initial.inv1", label = "Time 0 Investment", min = 170, max = 500, step = 1, value = 300)
)

renderHighchart({

    cfs.npv1 <- c(-1 * (input$initial.inv1), rep(input$cfs1, input$periods1))
    discount.rates <- seq(0, .3, by = .001)

    npv.sol <- 0
    for (i in 1:length(discount.rates) ){
        npv.sol[i] <- sum(cfs.npv1 / (1 + discount.rates[i])^{1:length(cfs.npv1)})        
    }

    source(file = 'https://raw.githubusercontent.com/FinancialMarkets/corpfin/master/irr.R')
    irr.sol2 <- irr(cfs.npv1)$IRR
    
    chart.data <- data.frame(cbind(discount.rates, npv.sol))
    names(chart.data) <- c("discount.rates", "npv.sol")
    
    # hchart(chart.data, "line", hcaes(x = discount.rates, y = npv.sol))
h2 <- highchart() %>% 
  hc_chart(type = "line") %>% 
  hc_add_series(data = round(chart.data$npv.sol, 2), name = "NPV") %>% 
  hc_xAxis(title = list(text = "Discount Rate"),
           categories = chart.data$discount.rates,
        plotLines = list(list(
          value = seq_along(chart.data$discount.rates)[chart.data$discount.rates == round(irr.sol2, 2)], 
          color = '#000fff',
          width = 3,
          zIndex = 4,
          label = list(text = paste0("IRR = ", round(irr.sol2, 2)),
                       style = list( color = '#000fff', fontWeight = 'bold'   )
          ))))
h2
# plot(chart.data$npv.sol ~ chart.data$discount.rates, type = 'l')

})


```


<!-- insert interactive app which shows differing ranked projects by npv and irr -->



*  Calculator

#+BEGIN_EXPORT html

<script>

var calculate = function() {

  var dividend_next_year = Number(document.getElementById("dividend").value);
  var g = Number(document.getElementById("g").value);
  var r = Number(document.getElementById("r").value);

  var price = dividend_next_year / (r - g);
  
  document.getElementById("out_price").innerHTML = price.toFixed(2);

}

</script>

<body class="all">
  <h3>
    Stock Price Calculator (Constant Gowth)
  </h3>

  <div class="row">

    <div class="column">
      <table style="width:100%">
        <tr>
          <th align="left">Dividend Next Year:</th>
          <th><input id="dividend" value="5" style="width: 50px"></th>
        </tr>
        <tr>
          <th align="left">Dividend Growth Rate:</th>
          <th><input id="g" value="0.07" style="width: 50px"></th>
        </tr>
	<tr>
	<th align="left">Discount Rate:</th>
        <th><input id="r" value="0.1" style="width: 50px"></th>
        </tr>
      </table>
      <button onclick="calculate()">
        Calculate.
      </button>
    </div>

    <div class="column">
    <p><b>Stock Price: <span id="out_price"></span></b></p>
    </div>

  </div>
  <br>
  <br>
  <br>
</body>

#+END_EXPORT

#+begin_comment
#+BEGIN_EXPORT html
<style>
.fiddle iframe {
height: 300px //you can manually change this height
}
</style>

<div class="fiddle">
<script async src="https://jsfiddle.net/mbkr1/jnzv5de1/embed/result,js,html,css/dark/"></script>
</div>
#+END_EXPORT

#+BEGIN_EXPORT html :eval no
<iframe width="100%" height="300" src="https://jsfiddle.net/mbkr1/jnzv5de1/embedded/js,html,css,result/dark/" allowfullscreen="allowfullscreen" allowpaymentrequest frameborder="0"></iframe>
#+END_EXPORT
#+end_comment



 
