index.html



<div id="outline-container-org01adb30" class="outline-2">
<h2 id="org01adb30"><span class="section-number-2">10.</span> Choosing Between Projects</h2>
<div class="outline-text-2" id="text-10">
<p>
When the accept/reject decision on one project does not affect another project, these projects are known as <b><b>independent</b></b>.  If accepting one project means you must reject another, then these projects are <b><b>mutually exclusive</b></b>. 
</p>

<p>
If a project has negative cash flows followed by all positive cash flows, then the project's cash flows are known as <b><b>conventional</b></b>.
</p>

<ul class="org-ul">
<li>If two projects are independent and have conventional cash flows, then NPV and IRR will lead to the same accept/reject decision, i.e. \(NPV \iff IRR\).  This is shown on the app in the following slide.</li>

<li>However, if you must rank projects &#x2013; and projects are either mutually exclusive or cash flows are not conventional &#x2013; then use NPV.  NPV will generate the correct decision, though IRR may not.</li>
</ul>
</div>
</div>



<div id="outline-container-org9548767" class="outline-2">
<h2 id="org9548767"><span class="section-number-2">11.</span> </h2>
<div class="outline-text-2" id="text-11">
<p>
&lt;!&#x2013; interactive app showing NVP for all discount rates and therefore IRR when crossing the x-axis &#x2013;&gt;
</p>

<p>
```{r, echo = FALSE, message = FALSE}
library(highcharter)
</p>

<p>
inputPanel(
    sliderInput("cfs1", label = "Cash Flow Per Period", min = 1, max = 45, step = 1, value = 30),
    sliderInput("periods1", label = "Number of Periods", min = 1, max = 50, step = 1, value = 20),
    sliderInput("initial.inv1", label = "Time 0 Investment", min = 170, max = 500, step = 1, value = 300)
)
</p>

<p>
renderHighchart({
</p>

<p>
cfs.npv1 &lt;- c(-1 * (input$initial.inv1), rep(input$cfs1, input$periods1))
discount.rates &lt;- seq(0, .3, by = .001)
</p>

<p>
npv.sol &lt;- 0
for (i in 1:length(discount.rates) ){
    npv.sol[i] &lt;- sum(cfs.npv1 / (1 + discount.rates[i])<sup>1:length(cfs.npv1)</sup>)        
}
</p>

<p>
source(file = 'https://raw.githubusercontent.com/FinancialMarkets/corpfin/master/irr.R')
irr.sol2 &lt;- irr(cfs.npv1)$IRR
</p>

<p>
chart.data &lt;- data.frame(cbind(discount.rates, npv.sol))
names(chart.data) &lt;- c("discount.rates", "npv.sol")
</p>

<p>
h2 &lt;- highchart() %&gt;% 
  hc<sub>chart</sub>(type = "line") %&gt;% 
  hc<sub>add</sub><sub>series</sub>(data = round(chart.data$npv.sol, 2), name = "NPV") %&gt;% 
  hc<sub>xAxis</sub>(title = list(text = "Discount Rate"),
           categories = chart.data$discount.rates,
        plotLines = list(list(
          value = seq<sub>along</sub>(chart.data$discount.rates)[chart.data$discount.rates == round(irr.sol2, 2)], 
          color = '#000fff',
          width = 3,
          zIndex = 4,
          label = list(text = paste0("IRR = ", round(irr.sol2, 2)),
                       style = list( color = '#000fff', fontWeight = 'bold'   )
          ))))
h2
</p>

<p>
})
</p>


<p>
```
</p>


<p>
&lt;!&#x2013; insert interactive app which shows differing ranked projects by npv and irr &#x2013;&gt;
</p>
</div>
</div>



<div id="outline-container-org9aa1afa" class="outline-2">
<h2 id="org9aa1afa"><span class="section-number-2">12.</span> Calculator</h2>
<div class="outline-text-2" id="text-12">

<script>

var calculate = function() {

  var dividend_next_year = Number(document.getElementById("dividend").value);
  var g = Number(document.getElementById("g").value);
  var r = Number(document.getElementById("r").value);

  var price = dividend_next_year / (r - g);
  
  document.getElementById("out_price").innerHTML = price.toFixed(2);

}

</script>

<body class="all">
  <h3>
    Stock Price Calculator (Constant Gowth)
  </h3>

  <div class="row">

    <div class="column">
      <table style="width:100%">
        <tr>
          <th align="left">Dividend Next Year:</th>
          <th><input id="dividend" value="5" style="width: 50px"></th>
        </tr>
        <tr>
          <th align="left">Dividend Growth Rate:</th>
          <th><input id="g" value="0.07" style="width: 50px"></th>
        </tr>
	<tr>
	<th align="left">Discount Rate:</th>
        <th><input id="r" value="0.1" style="width: 50px"></th>
        </tr>
      </table>
      <button onclick="calculate()">
        Calculate.
      </button>
    </div>

    <div class="column">
    <p><b>Stock Price: <span id="out_price"></span></b></p>
    </div>

  </div>
  <br>
  <br>
  <br>
</body>
</div>
</div>
